flute_RAS_case2/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

val 15.88;

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform $val;

boundaryField
{
    body
    {
        type            epsilonWallFunction;
        value           uniform $val;
    }
    closed
    {
        type            epsilonWallFunction;
        value           uniform $val;
    }
    opened
    {
        type            zeroGradient;
    }
    hole0
    {
        type            fixedValue;
        value           uniform $val;
    }
    hole1
    {
        type            zeroGradient;
    }
    hole2
    {
        type            zeroGradient;
    }
    hole3
    {
        type            zeroGradient;
    }
    hole4
    {
        type            zeroGradient;
    }
    hole5
    {
        type            zeroGradient;
    }
    hole6
    {
        type            zeroGradient;
    }
    hole7
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
