flute_RAS_case2/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    body
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    closed
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    opened
    {
        type            calculated;
        value           uniform 0;
    }
    hole0
    {
        type            calculated;
        value           uniform 0;
    }
    hole1
    {
        type            calculated;
        value           uniform 0;
    }
    hole2
    {
        type            calculated;
        value           uniform 0;
    }
    hole3
    {
        type            calculated;
        value           uniform 0;
    }
    hole4
    {
        type            calculated;
        value           uniform 0;
    }
    hole5
    {
        type            calculated;
        value           uniform 0;
    }
    hole6
    {
        type            calculated;
        value           uniform 0;
    }
    hole7
    {
        type            calculated;
        value           uniform 0;

    }
}


// ************************************************************************* //
