flute_RAS_case2/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    body
    {
        type            zeroGradient;
    }
    closed
    {
        type            zeroGradient;
    }
    opened
    {
        type            fixedValue;
        value           uniform 0;
    }
    hole0
    {
        type            zeroGradient;
    }
    hole1
    {
        type            fixedValue;
        value           uniform 0;
    }
    hole2
    {
        type            fixedValue;
        value           uniform 0;
    }
    hole3
    {
        type            fixedValue;
        value           uniform 0;
    }
    hole4
    {
        type            fixedValue;
        value           uniform 0;
    }
    hole5
    {
        type            fixedValue;
        value           uniform 0;
    }
    hole6
    {
        type            fixedValue;
        value           uniform 0;
    }
    hole7
    {
        type            fixedValue;
        value           uniform 0;
    }
}

// ************************************************************************* //
